docs/leets/0179-Largest-Number.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-11-15 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>0179. Largest Number</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-09-18
</div>
<div id="content" class="content">
<header>
<h1 class="title">0179. Largest Number</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0a2ffd0">Problem</a>
<ul>
<li><a href="#org67a7011">Example 1:</a></li>
<li><a href="#org5bd6769">Example 2:</a></li>
</ul>
</li>
<li><a href="#org2a42ebf">Solution Description</a>
<ul>
<li><a href="#org91f0015">Time and Space Complexity:</a></li>
</ul>
</li>
<li><a href="#org7d1793a">Example</a></li>
<li><a href="#org6e7ce23">References</a></li>
<li><a href="#orgcb96c82">Solution</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org0a2ffd0" class="outline-2">
<h2 id="org0a2ffd0">Problem</h2>
<div class="outline-text-2" id="text-org0a2ffd0">
<p>
Given a list of non-negative integers, you are required to arrange them such that they form the largest possible number.
</p>

<p>
The result should be returned as a string. When the input list contains only zeros, the result should be "0".
</p>
</div>

<div id="outline-container-org67a7011" class="outline-3">
<h3 id="org67a7011">Example 1:</h3>
<div class="outline-text-3" id="text-org67a7011">
<ul class="org-ul">
<li>Input: [10, 2]</li>
<li>Output: "210"</li>
</ul>
</div>
</div>

<div id="outline-container-org5bd6769" class="outline-3">
<h3 id="org5bd6769">Example 2:</h3>
<div class="outline-text-3" id="text-org5bd6769">
<ul class="org-ul">
<li>Input: [3, 30, 34, 5, 9]</li>
<li>Output: "9534330"</li>
</ul>

<p>
Constraints:
</p>
<ul class="org-ul">
<li>All elements in the list are non-negative integers.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2a42ebf" class="outline-2">
<h2 id="org2a42ebf">Solution Description</h2>
<div class="outline-text-2" id="text-org2a42ebf">
<p>
To implement the solution for arranging the numbers to form the largest possible number, we need to:
</p>
<ol class="org-ol">
<li>Convert the integers to strings to facilitate string comparison.</li>
<li>Sort the array with a custom comparator. The comparator should decide the order based on which combination of two numbers results in a larger concatenated number.</li>
<li>Concatenate the sorted numbers to form the final result.</li>
<li>Handle the edge case where the sorted number might start with a '0'.</li>
</ol>

<p>
The key insight is in the custom sorting comparator where for two numbers <code>a</code> and <code>b</code>, if <code>a + b</code> is greater than <code>b + a</code>, then <code>a</code> should come before <code>b</code>.
</p>
</div>

<div id="outline-container-org91f0015" class="outline-3">
<h3 id="org91f0015">Time and Space Complexity:</h3>
<div class="outline-text-3" id="text-org91f0015">
<ul class="org-ul">
<li>Time Complexity: O(N log N) due to sorting. Here, N is the number of elements in the list.</li>
<li>Space Complexity: O(N) for the space required to store the strings and their sorted order.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7d1793a" class="outline-2">
<h2 id="org7d1793a">Example</h2>
<div class="outline-text-2" id="text-org7d1793a">
<p>
Consider the input array: [3, 30, 34, 5, 9]
Step-by-step:
</p>
<ol class="org-ol">
<li>Convert to strings: ['3', '30', '34', '5', '9']</li>
<li>Sort using custom comparator: ['9', '5', '34', '3', '30']</li>
<li>Concatenate: "9534330"</li>
</ol>
</div>
</div>

<div id="outline-container-org6e7ce23" class="outline-2">
<h2 id="org6e7ce23">References</h2>
<div class="outline-text-2" id="text-org6e7ce23">
<p>
Refer to the sorting comparator concepts and how custom comparators work in modern JavaScript:
</p>
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/sort">Array.prototype.sort() - MDN Web Docs</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcb96c82" class="outline-2">
<h2 id="orgcb96c82">Solution</h2>
<div class="outline-text-2" id="text-orgcb96c82">
<p>
<a href="https://leetcode.com/submissions/detail/1394872925/">2024-09-18 Largest Number - Submission Detail - LeetCode</a> <code>leetcode.com</code>
</p>

<p>
Below is the solution implementation with a comprehensive testing setup:
</p>

<div class="org-src-container">
<pre class="src src-js">/**
 * Function to arrange numbers to form the largest number.
 * @param {number[]} nums - An array of non-negative integers
 * @returns {string} - The largest possible number in string format
 */
function largestNumber(nums) {
    const strs = nums.map(n =&gt; String(n));
    strs.sort((a, b) =&gt; (b + a) - (a + b));
    if (strs[0] === '0')  return '0';
    return strs.join('');
}

// Helper functions for logging
const log = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.log;
const table = typeof NestedInteger!== 'undefined' ? () =&gt; {} : console.table;

// Test cases
const testCases = [
    { nums: [10, 2], expected: "210" },
    { nums: [3, 30, 34, 5, 9], expected: "9534330" },
    { nums: [1], expected: "1" },
    { nums: [10], expected: "10" },
    { nums: [0, 0], expected: "0" }, // edge case
    { nums: [999999998, 999999999, 999999997, 999999996], expected: "999999999999999999899999997999999996"}
];

testCases.forEach((test, index) =&gt; {
    const result = largestNumber(test.nums);
    console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} (Expected: ${test.expected}, Got: ${result})`);
});
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
